Tekla Open API Reference for Tekla Structures 2025
SeamInputTypeAttribute Constructor (ConnectionBase.SeamInputType)
 The custom attribute [SeamInputType()] uses this to store the input type to the system. This is not to be used by itself.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SeamInputTypeAttribute(
	ConnectionBase.SeamInputType Type
)
Public Sub New (
	Type As ConnectionBase.SeamInputType
)
Parameters
Type
Type: Tekla.Structures.Plugins.ConnectionBase.SeamInputType
The seam input type.
See Also
Reference
SeamInputTypeAttribute Class
SeamInputTypeAttribute Overload
Tekla.Structures.Plugins Namespace